app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("firstname", "lastname", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "James"], ["lastname", "Smith"], ["address", "12 Street Road"], ["user_id", 6], ["created_at", 2017-03-23 21:27:23 UTC], ["updated_at", 2017-03-23 21:27:23 UTC]]

    def signedinuserprofile profile = Profile.find_by_user_id(current_user.id)
        if profile.nil?
            redirect_to "/profiles/new"
        else
            @profile = Profile.find_by_user_id(current_user.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 6], ["LIMIT", 1]]